templates/create.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:poj="http://pojos.ws.siveco.com">
    <soapenv:Header>
        <poj:securityHeaderType>
            <DataSource>{{.CoswinDatasource}}</DataSource>
            <UserName>{{.CoswinUsername}}</UserName>
            <password>{{.CoswinPassword}}</password>
            <language>PT_BR</language>
        </poj:securityHeaderType>
    </soapenv:Header>
    <soapenv:Body>
        <poj:workordercreatesimple>
            <WowoScheduleDate>{{.WowoScheduleDate}}</WowoScheduleDate>
            <WowoSupervisor/>
            <WorkOrderExtraViewworkordercreatesimple>
                <WowoEquipment>{{.WowoEquipment}}</WowoEquipment>
                <WowoJobType>CN</WowoJobType>
                <WowoJobClass>{{.WowoJobClass}}</WowoJobClass>
                <WowoJobDescription>{{.WowoJobDescription}}</WowoJobDescription>
            </WorkOrderExtraViewworkordercreatesimple>
        </poj:workordercreatesimple>
    </soapenv:Body>
</soapenv:Envelope>